RT-Thread/rt-thread/bsp/freescale/platform/system/src/clock/MKW20Z4/fsl_clock_MKW20Z4.h
    g_usbClkInFreq[srcInstance] = freq;
}
#endif// FSL_FEATURE_SOC_USB_COUNT

/*!
 * @brief Set the TPM external clock frequency(TPM_CLKx).
 *
 * This function sets the TPM external clock frequency (TPM_CLKx).
 *
 * @param  srcInstance External source instance.
 * @param  freq        Frequcney value.
 */
static inline void CLOCK_SYS_SetTpmExternalFreq(uint32_t srcInstance, uint32_t freq)
{
    assert(srcInstance < TPM_EXT_CLK_COUNT);

    g_tpmClkFreq[srcInstance] = freq;
}



/*!
 * @brief Enable the clock for LTC module.
 *
 * This function enables the clock for LTC module.
 * @param instance module device instance
 */
void CLOCK_SYS_EnableLtcClock(uint32_t instance);

/*!
 * @brief Disable the clock for LTC module.
 *
 * This function disables the clock for LTC module.
 * @param instance module device instance
 */
void CLOCK_SYS_DisableLtcClock(uint32_t instance);

/*!
 * @brief Get the the clock gate state for LTC module.
 *
 * This function will get the clock gate state for LTC module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool CLOCK_SYS_GetLtcGateCmd(uint32_t instance);

/*!
 * @brief Enable the clock for TRNG module.
 *
 * This function enables the clock for TRNG module.
 * @param instance module device instance
*/
static inline void CLOCK_SYS_EnableTrngClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateTrng0);
}

/*!
 * @brief Disable the clock for TRNG module.
 *
 * This function disables the clock for TRNG module.
 * @param instance module device instance
*/
static inline void CLOCK_SYS_DisableTrngClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateTrng0);
}

/*!
* @brief Get the clock gate state for TRNG module.
*
 * This function will get the clock gate state for TRNG module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
*/
static inline bool CLOCK_SYS_GetTrngGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM,kSimClockGateTrng0);
}

#if defined(__cplusplus)
}
#endif /* __cplusplus*/

/*! @}*/

#endif /* __FSL_CLOCK_KW20Z4_H__ */
/*******************************************************************************
 * EOF
 ******************************************************************************/

